Autodesk.Navisworks.Api.Schema.ReadAccessor
Provides read-only access into a Autodesk.Navisworks.Api.Schema.SchemaData via an associated Autodesk.Navisworks.Api.Schema.Field. Represents a given position inside Autodesk.Navisworks.Api.Schema.SchemaData.

Autodesk.Navisworks.Api.Schema.ReadAccessor.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.Schema.ReadAccessor.IsValid(Autodesk.Navisworks.Api.Schema.SchemaData)
Tests to see if this accessor is associated with a given Autodesk.Navisworks.Api.Schema.SchemaData.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentException:
Argument 'instance' has been Disposed